src/main/resources/api/examples/fedexFreight.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAPENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchemainstance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://fedex.com/ws/rate/v28">
	<SOAP-ENV:Body>
		<RateRequest>
			<WebAuthenticationDetail>
				<!--Optional: -->
				<ParentCredential>
					<Key>a0bRnbnp26tfOLsm</Key>
					<Password>kGdcjfCEDPyQhBE1EySTcr6td</Password>
				</ParentCredential>
				<UserCredential>
					<Key>a0bRnbnp26tfOLsm</Key>
					<Password>kGdcjfCEDPyQhBE1EySTcr6td</Password>
				</UserCredential>
			</WebAuthenticationDetail>
			<ClientDetail>
				<AccountNumber>510087780</AccountNumber>
				<MeterNumber>100717433</MeterNumber>
			</ClientDetail>
			<TransactionDetail>
				<CustomerTransactionId>RateRequest_v28</CustomerTransactionId>
			</TransactionDetail>
			<Version>
				<ServiceId>crs</ServiceId>
				<Major>28</Major>
				<Intermediate>0</Intermediate>
				<Minor>0</Minor>
			</Version>
			<RequestedShipment>
				<ShipTimestamp>2021-09-27T12:34:56-06:00</ShipTimestamp>
				pickupDate
				<DropoffType>REGULAR_PICKUP</DropoffType>
				<ServiceType>PRIORITY_OVERNIGHT</ServiceType>
				<PackagingType>FEDEX_BOX</PackagingType>
				PackagingType
				<TotalWeight>
					<Units>LB</Units>
					unitOfMeasurement.code
					<Value>20.0</Value>
					weight.value
				</TotalWeight>
				<Shipper>
					shipFrom
					<AccountNumber>510087780</AccountNumber>
					<Contact>
						<CompanyName>Company ABC</CompanyName>
						<PhoneNumber>8887776666</PhoneNumber>
					</Contact>
					<Address>
						<StreetLines>1202 Chalet Ln</StreetLines>
						<StreetLines>Do Not Delete - Test Account</StreetLines>
						<City>Harrison</City>
						<StateOrProvinceCode>AR</StateOrProvinceCode>
						<PostalCode>72601</PostalCode>
						<CountryCode>US</CountryCode>
					</Address>
				</Shipper>
				<Recipient>
					shipTo
					<AccountNumber>510087780</AccountNumber>
					<Contact>
						<PersonName>Omkar</PersonName>
						<PhoneNumber>7765657777</PhoneNumber>
					</Contact>
					<Address>
						<StreetLines>5700 Lombardo Ctr</StreetLines>
						<StreetLines>Ste 201</StreetLines>
						<City>Seven Hills</City>
						<StateOrProvinceCode>OH</StateOrProvinceCode>
						<PostalCode>44241</PostalCode>
						<CountryCode>US</CountryCode>
					</Address>
				</Recipient>
				<ShippingChargesPayment>
					<PaymentType>SENDER</PaymentType>
					<Payor>
						<ResponsibleParty>
							<AccountNumber>510087780</AccountNumber>
							<Tins>
								<TinType>BUSINESS_STATE</TinType>
								<Number>123456</Number>
							</Tins>
						</ResponsibleParty>
					</Payor>
				</ShippingChargesPayment>
				<RateRequestTypes>LIST</RateRequestTypes>
				<PackageCount>1</PackageCount>
				<RequestedPackageLineItems>
					<SequenceNumber>1</SequenceNumber>
					<GroupNumber>1</GroupNumber>
					<GroupPackageCount>1</GroupPackageCount>
					<Weight>
						weight
						<Units>LB</Units>
						<Value>20.0</Value>
					</Weight>
					<Dimensions>
						dimensions
						<Length>12</Length>
						<Width>12</Width>
						<Height>12</Height>
						<Units>IN</Units>
					</Dimensions>
					<ContentRecords>
						<PartNumber>345455</PartNumber>
						<ItemNumber>675455</ItemNumber>
						<ReceivedQuantity>12</ReceivedQuantity>
						<Description>ContentDescription</Description>
					</ContentRecords>
				</RequestedPackageLineItems>
			</RequestedShipment>
		</RateRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>